---
kind: other
id: Methods.T:Autodesk.Revit.DB.Plumbing.PipeInsulation
source: html/1c91fe20-1865-6af6-47f4-1744b7624aa0.htm
---
# PipeInsulation Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.